//
//  categoryIDs.swift
//  BookWithMe
//
//  Created by 계은성 on 7/9/25.
//

import Foundation
// MARK: - 장르 ID 매핑
//extension AladinAPI {
//    enum Genre {
//        static let categoryIDs: [String: String] = [
//            "문학": "1",
//            "건강/취미": "55890",
//            "경제경영": "170",
//            "공무원 수험서": "34582",
//            "과학": "987",
//            "달력/기타": "4395",
//            "대학교재/전문서적": "8257",
//            "만화": "2551",
//            "사회과학": "798",
//            "수험서/자격증": "1383",
//            "어린이": "1108",
//            "에세이": "55889",
//            "여행": "1196",
//            "역사": "74",
//            "예술/대중문화": "517",
//            "외국어": "1322",
//            "요리/살림": "1230",
//            "유아": "13789",
//            "인문학": "656",
//            "자기계발": "336",
//            "잡지": "2913",
//            "장르소설": "112011",
//            "전집/중고전집": "17195",
//            "종교/역학": "1237",
//            "좋은부모": "2030",
//            "청소년": "1137",
//            "컴퓨터/모바일": "351",
//            "초등학교참고서": "50246",
//            "중학교참고서": "76000",
//            "고등학교참고서": "76001"
//        ]
//    }
//    func getGenreIDs(genre: String) -> String {
//        return AladinAPI.Genre.categoryIDs[genre] ?? "1"
//    }
//    
//}
